Rhino.Inside.Revit API
GeometryEncoder.ToPoint Method
Overload List
Name | Description
ToPoint(Point)
 Converts the specified Rhino.Geometry.Point to an equivalent of Autodesk.Revit.DB.Point.
ToPoint(PointCloudItem)
 Converts the specified PointCloudItem to an equivalent Revit Point.
Top
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace